controllers/CommonController.php

        ]);
        //对商品做查询缓存
        $tui = Product::getDb()->cache(function(){
            return Product::find()->where('istuijian = "1" and ison = "1"')->orderBy('createtime desc')->limit(4)->all();
        }, 600, $dep);
        $new = Product::getDb()->cache(function(){
            return Product::find()->where('ison = "1"')->orderBy('createtime desc')->limit(4)->all();
        }, 600, $dep);
        $hot = Product::getDb()->cache(function(){
            return Product::find()->where('ison = "1" and ishot = "1"')->orderBy('createtime desc')->limit(4)->all();
---
SELECT * FROM `shop_product` WHERE istuijian = "1" and ison = "1" ORDER BY `createtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 4
SELECT * FROM `shop_product` WHERE ison = "1" and ishot = "1" ORDER BY `createtime` DESC LIMIT 4

//            return Product::find()->where('ison = "1" and issale = "1"')->orderBy('createtime desc')->limit(3)->all();
//        }, 60, $dep);
        $all = Product::getDb()->cache(function(){
            return Product::find()->where('ison = "1"')->orderBy('createtime desc')->limit(7)->all();
---
SELECT * FROM `shop_product` WHERE ison = "1" ORDER BY `createtime` DESC LIMIT 7